<a href="https://colab.research.google.com/github/yestrella14/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/LS_DS_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

Yeraldina Estrella


*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [1]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-07-16 20:24:39--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.217.16.222
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.217.16.222|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  16.7MB/s    in 13s

2020-07-16 20:24:53 (14.7 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [2]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [3]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [4]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [6]:
#lets create a list of the items we want to gather information

top10_products = ['Banana', 'Bag of Organic Bananas', 'Organic Strawberries', 'Organic Baby Spinach',
                'Organic Hass Avocado', 'Organic Avocado', 'Large Lemon',
                'Strawberries', 'Limes', 'Organic Whole Milk']

In [7]:
##### YOUR CODE HERE #####
#Import the libraries
import pandas as pd
import numpy as np
import seaborn as sns

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [8]:
#Lets load orders and products df

orders_df = pd.read_csv('orders.csv')
products_df = pd.read_csv('products.csv')
order_products_prior_df = pd.read_csv('order_products__prior.csv')
order_products_train_df = pd.read_csv('order_products__train.csv')

In [9]:
#Lets take a look at products
products_df.head()

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [10]:
#Lets take a look at orders
orders_df.head()

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [11]:
#Now lets look at Order_products Train
order_products_train_df.head()

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [12]:
#Lets Merge order-products trai ana and prior by using the concat method

order_products_merged = pd.concat([order_products_prior_df, order_products_train_df])
order_products_merged.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [13]:
#How big is the new dataframe?
order_products_merged.shape

(33819106, 4)

In [14]:
#We only need product name and product id from the products df. 
#Lets drop the rows not needed
products_df2 = products_df.drop(['aisle_id', 'department_id'], axis=1)
products_df2.head()

   product_id                                       product_name
0           1                         Chocolate Sandwich Cookies
1           2                                   All-Seasons Salt
2           3               Robust Golden Unsweetened Oolong Tea
3           4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4           5                          Green Chile Anytime Sauce

In [15]:
#Now lets merge the products_df2 with the merged orders df previously created
#Lets set the parameter how to 'outer' in order to merge all information in both dataframes
order_product = pd.merge(products_df2, order_products_merged, how='outer')
order_product.head()

   product_id                product_name  ...  add_to_cart_order  reordered
0           1  Chocolate Sandwich Cookies  ...                7.0        0.0
1           1  Chocolate Sandwich Cookies  ...                3.0        1.0
2           1  Chocolate Sandwich Cookies  ...                4.0        1.0
3           1  Chocolate Sandwich Cookies  ...                2.0        0.0
4           1  Chocolate Sandwich Cookies  ...               30.0        0.0

[5 rows x 5 columns]

In [18]:
#Do we have any missing data?
print('Total missing data in the product_id column? ' + str(order_product['product_id'].isnull().sum()))
print('Total missing data in the ordert_id column? '+ str(order_product['order_id'].isnull().sum()))

Total missing data in the product_id column? 0
Total missing data in the ordert_id column? 3

In [19]:
#Lets subset to only show the products we want

condition = order_product['product_name'].isin(top10_products)
print(order_product.shape)

#Create a new df with the filtered data
order_products2 = order_product[condition]
#Lets print the shape of the new dataframe to confirm we filtered the data to only those set on the condition
print(order_products2.shape)
#Do we have any missing values?
order_products2['product_name'].value_counts(dropna=False)

(33819109, 5)
(2418314, 5)

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

In [20]:
#Print the dataframe
order_products2.sample(15)

          product_id            product_name  ...  add_to_cart_order  reordered
16212964       24852                  Banana  ...                1.0        1.0
17489561       26209                   Limes  ...               18.0        0.0
8185331        13176  Bag of Organic Bananas  ...               13.0        1.0
16553419       24852                  Banana  ...                6.0        1.0
16445439       24852                  Banana  ...                1.0        1.0
14089042       21903    Organic Baby Spinach  ...                5.0        1.0
16339006       24852                  Banana  ...                8.0        1.0
10305493       16797            Strawberries  ...                1.0        1.0
7951077        13176  Bag of Organic Bananas  ...                6.0        1.0
32531818       47766         Organic Avocado  ...                4.0        1.0
13119457       21137    Organic Strawberries  ...                6.0        1.0
32282326       47626             Large Lemon  ...                2.0        1.0
16465396       24852                  Banana  ...                4.0        1.0
32248094       47626             Large Lemon  ...               12.0        1.0
13308053       21137    Organic Strawberries  ...               21.0        1.0

[15 rows x 5 columns]

In [21]:
#Any missing value on the filtered dataframe?
print(order_products2['product_id'].isnull().sum())
print(order_products2['product_name'].isnull().sum())
print(order_products2['order_id'].isnull().sum())
print(order_products2['add_to_cart_order'].isnull().sum())
print(order_products2['reordered'].isnull().sum())

0
0
0
0
0

In [22]:
#How many of each item was ordered??
display(order_products2['product_name'].value_counts(dropna=False))

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [45]:
#Importing again in case I only run this portion of the collab notebook
import pandas as pd
import numpy as np

table_1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])
table_2 = table_1.T
table_2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [46]:
# table2 -> tidy
#Lets reset the index
table_2 = table_2.reset_index()

table_2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [47]:
#Lets get the column name into a list
mycolumns = list(table_2.columns[1:])
mycolumns

['John Smith', 'Jane Doe', 'Mary Johnson']

In [48]:
#Table 2 to tidy using the melt method
tidy_2= table_2.melt(id_vars=mycolumns,
                   value_vars=['index'])
tidy_2

   John Smith  Jane Doe  Mary Johnson variable       value
0         NaN      16.0           3.0    index  treatmenta
1         2.0      11.0           1.0    index  treatmentb

In [49]:
#Lets get rid of the variable column
tidy_2 = tidy_2.drop(columns='variable')
tidy_2

   John Smith  Jane Doe  Mary Johnson       value
0         NaN      16.0           3.0  treatmenta
1         2.0      11.0           1.0  treatmentb

In [54]:
#Lets rename the column value
tidy_2 = tidy_2.rename(columns= {'value':'Treatment'})
tidy_2

   John Smith  Jane Doe  Mary Johnson   Treatment
0         NaN      16.0           3.0  treatmenta
1         2.0      11.0           1.0  treatmentb

In [55]:
#Lets replace treatmenta and treatmentb with just a or b correspondly
tidy_2['Treatment'] = tidy_2['Treatment'].str.replace('treatment', '')
tidy_2

   John Smith  Jane Doe  Mary Johnson Treatment
0         NaN      16.0           3.0         a
1         2.0      11.0           1.0         b

In [57]:
# tidy -> table2
wide2= tidy_2.pivot_table(index='Treatment')
wide2

           Jane Doe  John Smith  Mary Johnson
Treatment
a              16.0         NaN           3.0
b              11.0         2.0           1.0

In [58]:
#Load the flights dataset
flights = sns.load_dataset('flights')

In [59]:
#Whats in flights?
flights.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [60]:
# Flights Pivot Table
flight_pivot = flights.pivot_table(index = 'year', columns='month', values='passengers')
flight_pivot

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [ ]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [ ]:
##### YOUR CODE HERE #####